app/Controllers/Eventos.php

    public function eventosPorSede($sedeId)
    {
        $sede = $this->sedeModel->find($sedeId);

        if (!$sede) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound("Sede no encontrada");
        }

        $data = [
            'title' => 'Eventos en '.$sede['name'],
            'events' => $this->eventoModel->where('venue_id', $sedeId)->findAll(),
---
SELECT *
FROM `events`
WHERE `venue_id` = '5'