app/Controllers/Notificaciones.php

SELECT `notifications`.*, `users`.`username`
FROM `notifications`
JOIN `users` ON `users`.`id` = `notifications`.`user_id`
ORDER BY `sent_date` DESC
---
    public function index()
    {
        $data = [
            'notificaciones' => $this->notificacionesModel->select('notifications.*, users.username')
                                                        ->join('users', 'users.id = notifications.user_id')
                                                        ->orderBy('sent_date', 'DESC')
                                                        ->findAll(),
            'success' => session()->getFlashdata('success'),
            'error' => session()->getFlashdata('error')
        ];