app/Controllers/Reportes.php

    public function index()
    {
        $data = [
            'reportes' => $this->model->select('incident_reports.*, events.name as event_name, inventory_items.name as item_name')
                                    ->join('events', 'events.id = incident_reports.event_id')
                                    ->join('inventory_items', 'inventory_items.id = incident_reports.item_id')
                                    ->orderBy('report_date', 'DESC')
                                    ->findAll(),
            'success' => session()->getFlashdata('success'),
            'error' => session()->getFlashdata('error')
        ];
---
SELECT `incident_reports`.*, `events`.`name` as `event_name`, `inventory_items`.`name` as `item_name`
FROM `incident_reports`
JOIN `events` ON `events`.`id` = `incident_reports`.`event_id`
JOIN `inventory_items` ON `inventory_items`.`id` = `incident_reports`.`item_id`
ORDER BY `report_date` DESC