app/Controllers/User.php

SELECT *
FROM `users`
ORDER BY `id` DESC
---
    public function index()
    {
        $data = [
            'users' => $this->userModel->orderBy('id', 'DESC')->findAll(),
            'title' => 'Gestión de Usuarios',
        ];