app/Models/BookingModel.php

    public function getBookingsWithDetails()
    {
        return $this->select('bookings.*, users.username as customer_name, events.name as event_name, events.date as event_date')
            ->join('users', 'users.id = bookings.user_id')
            ->join('events', 'events.id = bookings.event_id')
            ->orderBy('booking_date', 'DESC')
            ->findAll();
---
SELECT `bookings`.*, `users`.`username` as `customer_name`, `events`.`name` as `event_name`, `events`.`date` as `event_date`
FROM `bookings`
JOIN `users` ON `users`.`id` = `bookings`.`user_id`
JOIN `events` ON `events`.`id` = `bookings`.`event_id`
ORDER BY `booking_date` DESC