app/Models/EventoModel.php

SELECT `events`.*, `venues`.`name` as `venue_name`, `venues`.`location`
FROM `events`
JOIN `venues` ON `venues`.`id` = `events`.`venue_id`
---
    public function getEventosConSede()
    {
        return $this->select('events.*, venues.name as venue_name, venues.location')
                   ->join('venues', 'venues.id = events.venue_id')
                   ->findAll();