app/Models/ReservationModel.php

    public function getReservationsWithDetails()
    {
        return $this->select('reservations.*, users.username as customer_name, venues.name as venue_name')
            ->join('users', 'users.id = reservations.customer_id')
            ->join('venues', 'venues.id = reservations.venue_id', 'left')
            ->orderBy('reservation_date', 'DESC')
            ->findAll();
---
SELECT `reservations`.*, `users`.`username` as `customer_name`, `venues`.`name` as `venue_name`
FROM `reservations`
JOIN `users` ON `users`.`id` = `reservations`.`customer_id`
LEFT JOIN `venues` ON `venues`.`id` = `reservations`.`venue_id`
ORDER BY `reservation_date` DESC