app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `username` = 'ian'
 LIMIT 1
---
    public function getUser($username)
    {
        return $this->where('username', $username)->first();

INSERT INTO `users` (`username`, `password`, `role`, `contact_info`) VALUES ('david', '$2y$10$K2NDhsc4myaKqKjlb7a7AeT2tI3BZNFM0RMnvJLmA1eSiSsxDyRXq', 'cliente', '')
---
    public function createUser($data)
    {
        // Asegurar que la contraseña se hashee correctamente
        if (isset($data['password'])) {
            $data['password'] = password_hash($data['password'], PASSWORD_DEFAULT);
        }
        return $this->insert($data);